---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ViewSheetFailures.ViewInAModelMustBeUnique
source: html/3f5a9937-e709-3b5e-21dd-05d1376b3da6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewSheetFailures.ViewInAModelMustBeUnique Property

Sheet views in this model cannot contain more than one instance of "%1!s!."

## Syntax (C#)
```csharp
public static FailureDefinitionId ViewInAModelMustBeUnique { get; }
```